const cardsData = {
    "GIS": [
        {
            title: 'По-добър мониторинг с данни в реално време',
            description: 'Компаниите могат да използват данни от ГИС, за да наблюдават промените в околната среда, причинени от техните дейности, като по този начин се оптимизира ефективността на работния процес.',
            imageUrl: function () {
                return `../common/images/GIS/${this.title}.jpg`
            }
        },
        {
            title: 'Вземане на решения въз основа на данни',
            description: 'Платформите за ГИС осигуряват точен анализ на информацията за вземане на решения, основани на данни. Критичните бизнес процеси се подобряват, тъй като сега компаниите не разчитат на прогнози, а разполагат с богата геоинформация за дейността на своята индустрия. Това им позволява да постигат целите си по-бързо и да пестят средства. Освен за спестяване на разходи, ГИС са изключително полезни за автоматизиране на работните процеси и за намиране на по-безопасни зони. Компаниите могат да се възползват от намаленото оперативно и транспортно време, което намалява въглеродния отпечатък.',
            imageUrl: function () {
                return `../common/images/GIS/${this.title}.jpg`
            }
        },
        {
            title: 'Подобрена оценка на терена',
            description: 'Организациите могат по-добре да разбират отдалечените пространствени модели, които помагат при докладването и оценката. Системите за данни за управление на терени позволяват на компаниите за възобновяема енергия да планират маршрути за евакуация, да добиват природни ресурси и да прогнозират резултатите, за да спазват екологичните изисквания. Физическата същност на околната среда оказва влияние върху много оперативни изпълнения, така че е жизненоважно да се оцени правилно теренът, за да се намалят сметките и да се спести време.',
            imageUrl: function () {
                return `../common/images/GIS/${this.title}.jpg`
            }
        },
        {
            title: "Оценка на жизнеспособността на мястото на проекта",
            description: "Информацията за местоположението може да помогне при оценката на способността на проектен обект да работи успешно. Анализът на геопространствени данни за енергийната индустрия дава много полезни сведения за възможните рискове и спецификата на работата в този или онзи район. Подробните географски данни позволяват на компаниите да предвидят рисковете и да се подготвят за възможните предизвикателства при функционирането на техните компании за възобновяеми енергийни източници.",
            imageUrl: function () {
                return `../common/images/GIS/${this.title}.jpg`
            }
        },
        {
            title: "Оптимизиране на проектирането и строителството",
            description: "ГИС елементите като карти, изображения и данни от дистанционни наблюдения могат да помогнат на компаниите при модернизирането на техните софтуерни функционалности. След като се има ясна представа за данните в реално време в района, може да се планира архитектурата и инфраструктурата на проекта по най-добрия начин, за да се осигурят устойчиви резултати.",
            imageUrl: function () {
                return `../common/images/GIS/${this.title}.jpg`
            }
        },
        {
            title: "Управление на енергийната мрежа",
            description: "С помощта на ГИС данни за възобновяемата енергия може да се постигне ефективно управление на енергийната мрежа. Картите позволяват да се моделират всички аспекти на проектната мрежа и да се генерира по-устойчива система.",
            imageUrl: function () {
                return `../common/images/GIS/${this.title}.jpg`
            }
        },
        {
            title: "Работни потоци в реално време",
            description: "ГИС осигуряват безпроблемен достъп до геоданни в реално време, които допринасят за ефективността на работните процеси. IoT сензорите (Изображение 1), заедно с подаването на данни в реално време, оптимизират начина, по който се  поддържат системите и се реагира на предизвикателства. Картографирането в реално време подобрява оперативната осведоменост и стандартите за безопасност.",
            imageUrl: function () {
                return `../common/images/GIS/${this.title}.jpg`
            }
        },
        {
            title: "Подобрена подкрепа за вземане на решения с изображения и дистанционно наблюдение",
            description: "Картите в устойчивата енергийна индустрия помагат за опазването на природните ресурси и околната среда чрез решения, основани на данни. Могат бързо да прогнозират потенциалното въздействие на своята дейност върху околната среда, за да предотвратят последствията. Растерният анализ, управлението на изображенията и мощните инструменти за визуализация ще спестят време и източници.",
            imageUrl: function () {
                return `../common/images/GIS/${this.title}.jpg`
            }
        },
        {
            title: "Оценяване на проекти за слънчева и вятърна енергия",
            description: "Методите на ВЕИ позволяват на проектите за устойчива енергия да работят ефективно, като използват търговски анализи. Днес ГИС и вятърната енергия, както и бизнесът с вода и слънчева енергия, са тясно свързани помежду си, защото анализът на данни позволява на компаниите да оценяват рисковете и рентабилността на проектите.",
            imageUrl: function () {
                return `../common/images/GIS/${this.title}.jpg`
            }
        }
    ],
    "Programming": [
        {
            title: 'Анализ и моделиране на данни',
            description: 'Програмирането е от съществено значение за събирането, анализирането и интерпретирането на данни от различни източници на зелена енергия. За анализ на данни и моделиране в сектора на възобновяемата енергия често се използват програмни езици като Python и R.',
            imageUrl: function () {
                return `../common/images/Programming/${this.title}.jpg`
            }
        },
        {
            title: 'Оптимизиране на енергийната ефективност',
            description: 'Разработването на алгоритми и софтуер за оптимизиране на работата на системите за възобновяема енергия е от решаващо значение за максималното увеличаване на производството на енергия и нейната ефективност. Техниките за машинно обучение могат да се прилагат за прогнозиране на производството и търсенето на енергия, което позволява по-добро управление на мрежата.',
            imageUrl: function () {
                return `../common/images/Programming/${this.title}.jpg`
            }
        },
        {
            title: 'Проектиране на системи за управление',
            description: 'Системите за контрол в инфраструктурата за възобновяема енергия, като например интелигентните мрежи (Препратка 2) и микромрежите, разчитат в голяма степен на програмиране за ефективно управление и разпределение на енергията. Контролът и мониторингът на енергийните системи в реално време изискват сложна разработка на софтуер.',
            imageUrl: function () {
                return `../common/images/Programming/${this.title}.jpg`
            }
        },
        {
            title: 'Интеграция на IoT - Интернет на нещата (IoT)',
            description: 'Интернет на нещата (IoT) все повече се интегрира в решенията за зелена енергия за дистанционно наблюдение и контрол. Необходими са програмисти, които да създават приложения и интерфейси на IoT за управление на системите за възобновяема енергия.',
            imageUrl: function () {
                return `../common/images/Programming/${this.title}.jpg`
            }
        },
        {
            title: 'Решения за съхранение на енергия',
            description: 'Ефективното съхранение на енергия е ключов компонент на решенията за зелена енергия. Програмирането се използва за разработване на софтуер за управление на системи за съхранение на енергия, като батерии. Алгоритмите помагат за оптимизиране на циклите на зареждане и разреждане, за да се удължи животът на батериите.',
            imageUrl: function () {
                return `../common/images/Programming/${this.title}.jpg`
            }
        },
        {
            title: 'Симулация и тестване',
            description: 'Програмирането позволява създаването на реалистични симулации за тестване на ефективността на технологиите за възобновяема енергия при различни условия. Симулациите помагат за идентифициране на потенциални проблеми и оптимизиране на проектите преди тяхното изпълнение. Симулациите и тестовете в програмирането, особено за оценка на ефективността на технологиите за възобновяема енергия при различни условия, обикновено се осъществяват с помощта на езици като Python, MATLAB и специализирани фреймуърци за симулация като Simulink.',
            imageUrl: function () {
                return `../common/images/Programming/${this.title}.jpg`
            }
        },
        {
            title: 'Визуализация на данни',
            description: 'Визуализирането на сложни данни за енергията е от съществено значение за получаване на подкрепа и вземане на информирани решения. Програмирането се използва за създаване на инструменти за визуализация на данни и информационни табла (3Djs (Препратка 4), Matplotlib и Seaborn, Plotly и т.н.).',
            imageUrl: function () {
                return `../common/images/Programming/${this.title}.jpg`
            }
        },
        {
            title: 'Мониторинг и поддръжка',
            description: 'Системите за дистанционно наблюдение и прогнозна поддръжка, задвижвани от програмиране и IoT, гарантират, че инфраструктурата за възобновяема енергия работи ефективно и надеждно. Прогнозната поддръжка може да предотврати скъпоструващи престои.',
            imageUrl: function () {
                return `../common/images/Programming/${this.title}.jpg`
            }
        },
        {
            title: 'Интеграция на енергийния пазар',
            description: 'Необходимо е да се разработи софтуер за интегриране на възобновяемите енергийни източници в енергийните пазари, който да позволи ефективна покупка и продажба на зелена енергия. Блокчейн технологията (Препратка 5) е в процес на проучване за прозрачна и сигурна търговия с енергия.',
            imageUrl: function () {
                return `../common/images/Programming/${this.title}.jpg`
            }
        },
        {
            title: 'Съответствие с политиката и нормативната уредба',
            description: 'Необходими са програмисти за разработване на софтуерни инструменти за проследяване на спазването на политиките и регулациите в областта на възобновяемата енергия. Тези инструменти помагат да се гарантира, че доставчиците на енергия изпълняват целите за възобновяема енергия.',
            imageUrl: function () {
                return `../common/images/Programming/${this.title}.jpg`
            }
        },
    ],
    "AI": [
        {
            title: 'Ролята на машинното обучение в енергийния сектор',
            description: 'Машинното обучение и анализът на данни са ценни за управлението и стимулирането на енергийния сектор. Енергийните мрежи, възобновяемите енергийни източници и децентрализираните мрежи могат да се възползват от постепенното интегриране на AI и ML за оптимизиране на използването на енергия. Бъдещето на енергийния сектор ще бъде силно повлияно от машинното обучение поради широко разпространения недостиг на квалифициран персонал, нарастващата зависимост от интелигентните технологии и търсенето на по-икономични и устойчиви енергийни източници.',
            imageUrl: function () {
                return `../common/images/AI/${this.title}.jpg`
            }
        },
        {
            title: 'Предсказваща поддръжка',
            description: 'Машинното обучение анализира исторически данни и данни в реално време от различни източници, за да определи кои системи и подсистеми е най-вероятно да се повредят и кога. С помощта на машинното обучение оборудването може да се наблюдава в реално време и да се предвиждат предварително всички възможни повреди. Това подобрява цялостната ефективност на оборудването, като същевременно спестява високи разходи.',
            imageUrl: function () {
                return `../common/images/AI/${this.title}.jpg`
            }
        },
        {
            title: 'Управление на електроенергийните мрежи',
            description: 'Поддържането на баланс между производството и търсенето на електроенергия по всяко време е един от основните проблеми при управлението на електроенергийните системи. Машинното обучение може да подобри издръжливостта и баланса, особено за мрежите за възобновяема енергия.',
            imageUrl: function () {
                return `../common/images/AI/${this.title}.jpg`
            }
        },
        {
            title: 'Прогнозиране на търсенето на енергия',
            description: 'Прогнозирането на търсенето на енергия е друга потенциална употреба на алгоритмите за машинно обучение в енергийната индустрия. Това се постига чрез наблюдение на това как дневното потребление на енергия на всеки клиент се променя във времето. Машинното обучение в енергийния сектор може да се използва за оптимизиране на производството на енергия с цел по-ефективно използване на ресурсите и намаляване на разходите.',
            imageUrl: function () {
                return `../common/images/AI/${this.title}.jpg`
            }
        },
        {
            title: 'Прогнозиране на вятърната енергия с помощта на дълготрайна памет (LSTM)',
            description: 'Подобряване точността на прогнозиране на производството на вятърна енергия с цел оптимизиране на работата на вятърните паркове, като използва LSTM/Long Short-Term Memory (Препратка 8). В техниките за преобразуване на вятърна енергия, като динамичното управление на вятърните турбини и планирането на енергийната система, надеждните краткосрочни прогнози за скоростта на вятъра са изключително практични и решаващи. Скоростта на вятъра, която има предсказуем модел за определен период от време, е ключов фактор за генерираната мощност, създадена от вятъра.',
            imageUrl: function () {
                return `../common/images/AI/${this.title}.jpg`
            }
        },
        {
            title: 'Анализ и прогнози за глобалното затопляне',
            description: 'Анализът на глобалното затопляне дава възможност на хората да разберат и да се справят с последиците от него, мотивира ги да променят поведението си и подпомага способността им да реагират на това, което вече е световен проблем.  Може да се създаде модел за машинно обучение, за да се прогнозират бъдещи промени във валежите, температурата и други метеорологични показатели, за да се осигурят познания, които могат да послужат за изготвяне на политики и вземане на решения във връзка с изменението на климата.',
            imageUrl: function () {
                return `../common/images/AI/${this.title}.jpg`
            }
        },
        {
            title: 'Прогнозиране на слънчевата енергия',
            description: 'Използване на  данни от различни метеорологични променливи, за да се прогнозира почасовата мощност на фотоволтаична електроцентрала.',
            imageUrl: function () {
                return `../common/images/AI/${this.title}.jpg`
            }
        },
        {
            title: 'Класификация на вятърните турбини',
            description: 'Постигането на възможно най-голяма икономическа ефективност на вятърната ферма е от решаващо значение за превръщането на вятъра в достъпен източник на енергия.  Използване на алгоритми за класификация на сигнали от SCADA за вятърна ферма, за да се предскажат предварително едновременно няколко дефекта на вятърни турбини. Използват се три класификационни алгоритъма - дървета на решенията (Decision Trees), случайни гори (Random Forests) и k най-близки съседи (K-Nearest Neighbours), използване на небалансирани и балансирани данни за обучение.',
            imageUrl: function () {
                return `../common/images/AI/${this.title}.jpg`
            }
        },
        {
            title: 'Прогнозиране на стабилността на интелигентните мрежи',
            description: 'Използване на алгоритми за машинно обучение за прогнозиране и предотвратяване на нестабилността на електропреносната мрежа за ефективна и надеждна електропреносна мрежа с по-малко прекъсвания. В една интелигентна мрежа се събират данни за търсенето от страна на клиентите, прави се централизиран анализ на търсенето и предлагането и предложените данни за цените се предоставят на потребителите, за да вземат решение за използването им. Прилага се секвенционния модел на Keras (Sequential Model), за да постигне възможно най-точни прогнози. Използване на набор от данни, включващ резултати от симулации на стабилността на мрежата за примерна 4-звездна мрежа.',
            imageUrl: function () {
                return `../common/images/AI/${this.title}.jpg`
            }
        }
    ]
}

function changeCardContent(index, view) {
    const card = document.querySelector(".card");
    card.classList.remove("fade-in-animation");

    document.querySelector("#current-card-index").textContent = index;
    document.querySelector(".images").src = cardsData[view][index].imageUrl();
    document.querySelector(".shown h5").textContent = cardsData[view][index].title;
    document.querySelector(".hidden p").textContent = cardsData[view][index].description;

    void card.offsetWidth;
    card.classList.add("fade-in-animation");
}

function incrementCard(e, view) {
    const currentIndex = Number(document.querySelector("#current-card-index").textContent) + 1 === cardsData[view].length ? 0 : Number(document.querySelector("#current-card-index").textContent) + 1;
    // console.log(currentIndex);

    changeCardContent(currentIndex, view);
}

function decrementCard(e, view) {
    const currentIndex = Number(document.querySelector("#current-card-index").textContent) - 1 < 0 ? cardsData[view].length - 1 : Number(document.querySelector("#current-card-index").textContent) - 1;
    // console.log(currentIndex);

    changeCardContent(currentIndex, view);
}
